In [4]:
import pandas as pd

In [6]:
pip install pandas

Requirement already satisfied: pandas in c:\users\nurla\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\nurla\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\nurla\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\nurla\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\nurla\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\nurla\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
l =  [1,2,3,4,5]

In [2]:
l

[1, 2, 3, 4, 5]

In [12]:
pd.DataFrame(l , columns= ["title"])

   title
0      1
1      2
2      3
3      4
4      5

In [14]:
import numpy as np

In [18]:
np.arange(9).reshape((3,3))

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [19]:
k = np.arange(9).reshape((3,3))

In [20]:
pd.DataFrame(k, columns= ["vaq1" , "Var2" , "var3"])

   vaq1  Var2  var3
0     0     1     2
1     3     4     5
2     6     7     8

In [65]:
s1 = np.random.randint(20, size=5)
s2 = np.random.randint(20, size=5)
s3 = np.random.randint(20, size=5)

In [66]:
lis = {"var1":s1, "var2":s2, "var3":s3}

In [31]:
lis

{'var1': array([4, 0, 6, 1, 5], dtype=int32),
 'var2': array([0, 9, 1, 0, 1], dtype=int32),
 'var3': array([1, 3, 9, 2, 3], dtype=int32)}

In [36]:
m = pd.DataFrame(lis)

In [37]:
m

   var1  var2  var3
0     4     0     1
1     0     9     3
2     6     1     9
3     1     0     2
4     5     1     3

In [38]:
m.index = ["a","b","c","d","e"]

In [39]:
m

   var1  var2  var3
a     4     0     1
b     0     9     3
c     6     1     9
d     1     0     2
e     5     1     3

In [40]:
m[0:2]

   var1  var2  var3
a     4     0     1
b     0     9     3

In [42]:
m["a":"d"]

   var1  var2  var3
a     4     0     1
b     0     9     3
c     6     1     9
d     1     0     2

In [43]:
m.drop("a", axis=0)

   var1  var2  var3
b     0     9     3
c     6     1     9
d     1     0     2
e     5     1     3

In [45]:
m.drop("d", axis=0)

   var1  var2  var3
a     4     0     1
b     0     9     3
c     6     1     9
e     5     1     3

In [46]:
m.drop("d", axis=0 , inplace=True)

In [47]:
m

   var1  var2  var3
a     4     0     1
b     0     9     3
c     6     1     9
e     5     1     3

In [62]:
m.drop("a",axis=0)

   var1  var2  var3
b     0     9     3

In [64]:
m["var1"]

a    4
b    0
Name: var1, dtype: int32

In [67]:
m = pd.DataFrame(lis)

In [68]:
m

   var1  var2  var3
0     9     2     8
1    18     6    15
2     3     7     4
3     4     4    13
4     3    11     4

In [69]:
m.var1

0     9
1    18
2     3
3     4
4     3
Name: var1, dtype: int32

In [78]:

m[m.var1 > 2]

   var1  var2  var3
0     9     2     8
1    18     6    15
2     3     7     4
3     4     4    13
4     3    11     4

In [84]:
m[(m.var1 > 2) &  (m.var3 > 2) & (m.var1 > 2)]

   var1  var2  var3
0     9     2     8
1    18     6    15
2     3     7     4
3     4     4    13
4     3    11     4

In [89]:
m.loc[(m.var1 > 2), ["var1", "var2"]]

   var1  var2
0     9     2
1    18     6
2     3     7
3     4     4
4     3    11

In [98]:
m[m.var1 > 3][["var2", "var1"]]

   var2  var1
0     2     9
1     6    18
3     4     4